# Lab- 1 Machine Learning - AP21110010018

### Introduction To Numpy

1. Write a NumPy program to multiply two given arrays of same size element-by-element.
2. Write a NumPy program to find the missing data in a given array.
3. Write a NumPy program to test whether each element of a 1-D array is also present in a second array.
4. Write a NumPy program to save a NumPy array to a text file.
5. Write a NumPy program to Create a 1-D array of 30 evenly spaced elements between 2.5. and 6.5, inclusive.

In [2]:
import numpy as np
import pandas as pd

In [4]:
#1. Write a NumPy program to multiply two given arrays of same size element-by-element.
a1=np.array([1,2,3,4])
a2=np.array([12,23,13,44])
ans=a1*a2
print(ans)

[ 12  46  39 176]

In [6]:
#Write a NumPy program to find the missing data in a given array.
data=np.array([1,2,np.nan,4,5,np.nan])
missing=np.isnan(data)
print("missing data: ",np.where(missing)[0])

missing data:  [2 5]


- The expression np.where(missing_indices)[0] is used to extract the indices where the condition specified by missing_indices is true.

In [8]:
#Write a NumPy program to test whether each element of a 1-D array is also present in a second array.
n1=np.array([1,2,3,8,9])
n2=np.array([11,1,20,4,5])
result=np.isin(n1,n2)
print(result)

[ True False False False False]

- np.isin() function in NumPy is used to test element-wise whether elements of one array are present in another array. It returns a boolean array of the same shape as the input array, where each element is True if the corresponding element in the input array is present in the specified set of values.

In [9]:
#Write a NumPy program to save a NumPy array to a text file.

data_array = np.array([[1, 4, 3], [14, 25, 36]])

np.savetxt('4_output.txt', data_array, delimiter=',')

- np.savetxt(): This function is used to save an array to a text file.

- 'output.txt': This is the filename where the array will be saved. In this case, the file will be named "output.txt."

- data_array: This is the NumPy array that you want to save to the text file.

- delimiter=',': This specifies the delimiter to use between the values in the text file. In this case, a comma , is used as the delimiter.

In [ ]:
#Write a NumPy program to create a 1-D array of 30 evenly spaced elements between 2.5 and 6.5, inclusive.

In [10]:
result_array = np.linspace(2.5, 6.5, 30)
print(result_array)

[2.5        2.63793103 2.77586207 2.9137931  3.05172414 3.18965517
 3.32758621 3.46551724 3.60344828 3.74137931 3.87931034 4.01724138
 4.15517241 4.29310345 4.43103448 4.56896552 4.70689655 4.84482759
 4.98275862 5.12068966 5.25862069 5.39655172 5.53448276 5.67241379
 5.81034483 5.94827586 6.0862069  6.22413793 6.36206897 6.5       ]

- np.linspace(): This function generates evenly spaced values over a specified range.

- 2.5: The starting value of the sequence.

- 6.5: The end value of the sequence.

- 30: The number of evenly spaced values to generate between the start and end.

## Introduction to Pandas (Series and Dataframes)
1. Write a Pandas program to convert Series of lists to one Series.
2. Write a Pandas program to create a subset of a given series based on value and condition.
3. Write a Pandas program to display most frequent value in a given series and replace everything else as 'Other' in the series.
4. Write a Pandas program to find the positions of numbers that are multiples of 5 of a given series.
5. Write a Pandas program to calculate the number of characters in each word in a given series.
6. Write a Pandas program to convert year-month string to dates adding a specified day of the month.
7. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
8. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.
9. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.
10. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.
11. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.
112. Write a Pandas program to remove infinite values from a given DataFrame.

In [ ]:
#Write a Pandas program to convert Series of lists to one Series.

In [11]:
series_eg = pd.Series([[1,2,3,4],[21,22],[6]])
result=series_eg.explode()
print(result)

0     1
0     2
0     3
0     4
1    21
1    22
2     6
dtype: object

- a Series is a one-dimensional labeled array capable of holding any data type. It is a fundamental data structure in Pandas and is similar to a column in a spreadsheet or a single-dimensional array.
-  this example, the original Series data contains three lists: [1, 2, 3,4], [21, 22], and [6]. After applying explode(), each element in the lists is "exploded" into a separate row, resulting in a new Series result_series where each value is an individual item:

In [12]:
## Write a Pandas program to create a subset of a given series based on value and condition.
data = pd.Series([10, 20, 30, 40, 50, 60])
condition = data > 30
subset = data[condition]
print("Original Series:")
print(data)

print("\nSubset based on condition:")
print(subset)

Original Series:
0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

Subset based on condition:
3    40
4    50
5    60
dtype: int64

In [15]:
##Write a Pandas program to display most frequent value in a given series and replace everything else as 'Other' in the series.
data = pd.Series([1, 2, 2, 3, 3, 3, 4, 4, 5, 5, 5, 5])
most_frequent_value = data.mode().iloc[0]
data[data != most_frequent_value] = 'Other'
data

0     Other
1     Other
2     Other
3     Other
4     Other
5     Other
6     Other
7     Other
8         5
9         5
10        5
11        5
dtype: object

- data.mode().iloc[0]: The iloc[0] part is used to retrieve the first (or in this case, the only) element from the result of data.mode(). Since data.mode() returns a Series, iloc[0] is used to access the first value in that Series.

In [16]:
#Write a Pandas program to find the positions of numbers that are multiples of 5 of a given series.
data = pd.Series([1, 5, 10, 15, 20, 25, 30, 35, 40])
positions = data.index[data % 5 == 0].tolist()
print("Positions of numbers that are multiples of 5:", positions)

Positions of numbers that are multiples of 5: [1, 2, 3, 4, 5, 6, 7, 8]

In [18]:
#Write a Pandas program to calculate the number of characters in each word in a given series.
words_series = pd.Series(['sanjana', 'maruthi', 'cherish', 'srujitha', 'mahitha'])
word_lengths = words_series.str.len()
result_df = pd.DataFrame({'Word': words_series, 'Length': word_lengths})
result_df

       Word  Length
0   sanjana       7
1   maruthi       7
2   cherish       7
3  srujitha       8
4   mahitha       7

In [19]:
## Write a Pandas program to convert year-month string to dates adding a specified day of the month.
year_month_strings = pd.Series(['2022-01', '2022-02', '2022-03', '2022-04'])
specified_day = 15
dates_with_specified_day = pd.to_datetime(year_month_strings + '-' + str(specified_day), format='%Y-%m-%d')
result_df = pd.DataFrame({'Year-Month String': year_month_strings, 'Converted Date': dates_with_specified_day})
result_df

  Year-Month String Converted Date
0           2022-01     2022-01-15
1           2022-02     2022-02-15
2           2022-03     2022-03-15
3           2022-04     2022-04-15

In [21]:
#Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
data = {'Name': ['Sanjana', 'sanju', 'Cherish', 'Daddy'],
        'Age': [20, 20, 21, 45],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}

index_labels = ['Person1', 'Person2', 'Person3', 'Person4']
df = pd.DataFrame(data, index=index_labels)
df

            Name  Age           City
Person1  Sanjana   20       New York
Person2    sanju   20  San Francisco
Person3  Cherish   21    Los Angeles
Person4    Daddy   45        Chicago

In [23]:
#Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.
import pandas as pd
data = {'Name': ['Sanjana', 'Srujitha', 'Cherish', 'Joy'],
        'Attempts': [1, 3,10, 4]}

df = pd.DataFrame(data)
result_df = df[df['Attempts'] > 2]
result_df

       Name  Attempts
1  Srujitha         3
2   Cherish        10
3       Joy         4

In [31]:
#Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.
import pandas as pd

data = {'Name': ['Sanjana', 'Srujitha', 'Cherish', 'Joy']}
df = pd.DataFrame(data)

new_row_values = {'Name': 'Mahitha'}

print("DataFrame with New Row:")
print(df)

df = df.drop(df[df['Name'] == 'Mahitha'].index)
print("\nOriginal DataFrame after Deleting 'Mahitha':")
df

DataFrame with New Row:
       Name
0   Sanjana
1  Srujitha
2   Cherish
3       Joy

Original DataFrame after Deleting 'Mahitha':

       Name
0   Sanjana
1  Srujitha
2   Cherish
3       Joy

In [33]:
#Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.
import pandas as pd

data = {'name': ['Sanjana', 'Srujitha', 'Cherish', 'Joy'],
        'score': [90, 85, 75, 95],
        'qualify': ['yes', 'yes', 'no', 'yes']}

df = pd.DataFrame(data)


df_sorted = df.sort_values(by=['name', 'score'], ascending=[False, True])
print("Sorted DataFrame:")
df_sorted

Sorted DataFrame:

       name  score qualify
1  Srujitha     85     yes
0   Sanjana     90     yes
3       Joy     95     yes
2   Cherish     75      no

In [35]:
#Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.
import pandas as pd

data = {'name': ['Sanjana', 'Srujitha', 'Cherish', 'Joy'],
        'score': [90, 85, 75, 95],
        'qualify': ['yes', 'yes', 'no', 'yes']}

df = pd.DataFrame(data)
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print("DataFrame after Replacing 'yes' and 'no' with True and False:")
df

DataFrame after Replacing 'yes' and 'no' with True and False:

       name  score  qualify
0   Sanjana     90     True
1  Srujitha     85     True
2   Cherish     75    False
3       Joy     95     True

In [37]:
#Write a Pandas program to remove infinite values from a given DataFrame.
import pandas as pd
import numpy as np

# Original DataFrame with infinite values
data = {'name': ['Sanjana', 'Srujitha', 'Cherish', 'Joy'],
        'score': [90, np.inf, 75, -np.inf]}

df = pd.DataFrame(data)


df.replace([np.inf, -np.inf], np.nan, inplace=True)


df = df.dropna()

# Display the DataFrame after removing infinite values
print("DataFrame after Removing Infinite Values:")
df

DataFrame after Removing Infinite Values:

      name  score
0  Sanjana   90.0
2  Cherish   75.0